Ran Plan for project: `github` dir: `apps/github` workspace: `github`

<details><summary>Show Output</summary>

```diff
github_repository.repo["dotfiles-nix"]: Drift detected (update)
github_repository.repo["obs-go-cli"]: Drift detected (update)
github_repository.repo["dotfiles"]: Drift detected (update)
github_repository.repo["k8s-apps"]: Drift detected (update)
github_repository.repo["deckmaster-config"]: Drift detected (update)
github_repository.repo["obs-wiki"]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # github_actions_secret.dockerhub_token will be destroyed
- resource "github_actions_secret" "dockerhub_token" {
      - created_at      = "2024-01-16 05:59:26 +0000 UTC" -> null
      - encrypted_value = (sensitive value) -> null
      - id              = "twitch-bot:DOCKERHUB_TOKEN" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "twitch-bot" -> null
      - secret_name     = "DOCKERHUB_TOKEN" -> null
      - updated_at      = "2024-01-16 05:59:26 +0000 UTC" -> null
    }

  # github_actions_secret.dockerhub_token["meal-notifier"] will be created
+ resource "github_actions_secret" "dockerhub_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "meal-notifier"
      + secret_name     = "DOCKERHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.dockerhub_token["twitch-bot"] will be created
+ resource "github_actions_secret" "dockerhub_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "twitch-bot"
      + secret_name     = "DOCKERHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.dockerhub_username will be destroyed
- resource "github_actions_secret" "dockerhub_username" {
      - created_at      = "2024-01-16 05:59:28 +0000 UTC" -> null
      - encrypted_value = (sensitive value) -> null
      - id              = "twitch-bot:DOCKERHUB_USERNAME" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "twitch-bot" -> null
      - secret_name     = "DOCKERHUB_USERNAME" -> null
      - updated_at      = "2024-01-16 05:59:28 +0000 UTC" -> null
    }

  # github_actions_secret.dockerhub_username["meal-notifier"] will be created
+ resource "github_actions_secret" "dockerhub_username" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "meal-notifier"
      + secret_name     = "DOCKERHUB_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.dockerhub_username["twitch-bot"] will be created
+ resource "github_actions_secret" "dockerhub_username" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "twitch-bot"
      + secret_name     = "DOCKERHUB_USERNAME"
      + updated_at      = (known after apply)
    }

Plan: 4 to add, 0 to change, 2 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p github`
* :put_litter_in_its_place: To **delete** this plan click [here](http:/lock?id=mvaldes14%252Fterraform%252Fapps%252Fgithub%252Fgithub)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p github`
</details>
Plan: 4 to add, 0 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`